2018/python-metaclass.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-09-15 周六 22:39 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 元类</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/org-html-theme-list/org-note/style/main.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 元类</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3147e5e">1. 前言</a></li>
<li><a href="#org8a18c5f">2. type</a></li>
<li><a href="#orgf57292a">3. 元类的定义</a></li>
<li><a href="#org8401c9b">4. 类属性和实例属性</a></li>
<li><a href="#org9ec5f66">5. 元类的使用</a></li>
<li><a href="#org7671369">6. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3147e5e" class="outline-2">
<h2 id="org3147e5e"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>元类</b> 在 <code>Python</code> 中是一个很强大也很有趣的功能， 强大在于你可以通过元类来控制 <b>创建类</b> 时的行为，
有趣在于通过元类你可以体会到 <b>类和实例</b> 之间奇妙的关系。
</p>
</div>
</div>

<div id="outline-container-org8a18c5f" class="outline-2">
<h2 id="org8a18c5f"><span class="section-number-2">2</span> type</h2>
<div class="outline-text-2" id="text-2">
<p>
<code>Python</code> 作为动态语言， 类型是在运行时创建和确定的， 默认情况下， 用于创建类的就是 <code>type</code>.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">type</span>(name, bases, <span style="font-weight: bold;">dict</span>) -&gt; a new <span style="font-weight: bold;">type</span>
</pre>
</div>

<p>
当 <code>type</code> 用于创建类时， 参数分别为：
</p>
<ul class="org-ul">
<li><b>name</b> - 类名</li>
<li><b>bases</b> - 基类元组</li>
<li><b>dict</b> - 属性字典</li>
</ul>

<p>
举个栗子：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__repr__</span>(<span style="font-weight: bold;">self</span>):
    <span style="font-weight: bold;">return</span> <span style="font-style: italic;">'The type of this instance is %s.'</span> % <span style="font-weight: bold;">self</span>.__class__


<span style="font-weight: bold; font-style: italic;">TestClass</span> = <span style="font-weight: bold;">type</span>(<span style="font-style: italic;">'TestClass'</span>, (<span style="font-weight: bold;">object</span>,), {<span style="font-style: italic;">'__repr__'</span>: __repr__})

<span style="font-weight: bold;">print</span>(TestClass())

<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">output ##</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">The type of this instance is &lt;class '__main__.TestClass'&gt;.</span>
</pre>
</div>

<p>
这个例子中， 创建了名为 <code>TestClass</code> 的类， 其基类为 <code>object</code>, 只定义了方法 <code>__repr__</code>.
</p>

<p>
等价于以下定义：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestClass</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__repr__</span>(<span style="font-weight: bold;">self</span>):
        <span style="font-weight: bold;">return</span> <span style="font-style: italic;">'The type of this instance is %s.'</span> % <span style="font-weight: bold;">self</span>.__class__
</pre>
</div>

<p>
在这种情况下， <code>type</code> 相当于一个 <b>类</b>, 因此我们可以继承 <code>type</code>, 然后使用 <code>type</code> 的子类即 <b>元类</b> 
来创建类。
</p>

<p>
此时， 我们需要关注元类的几个方法： <code>__new__</code>, <code>__init__</code>, <code>__call__</code>.
</p>
</div>
</div>

<div id="outline-container-orgf57292a" class="outline-2">
<h2 id="orgf57292a"><span class="section-number-2">3</span> 元类的定义</h2>
<div class="outline-text-2" id="text-3">
<p>
<b>元类(metaclass)</b> 属于 <code>type</code> 的子类， 而 <b>类</b> 属于 <b>元类</b> 的 <b>实例</b>.
</p>

<p>
使用 <b>元类</b> 创建类， 就是创建 <b>元类的实例</b>.
</p>

<p>
和创建实例密切相关的两个方法为 <code>__new__</code> 和 <code>__init__</code>. 对于这两者的关系与使用可以查看博客： <a href="python-new-instance.html">Python 构造对象实例</a>.
</p>

<p>
这里来看它们在 <b>元类</b> 中的使用：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MyMetaClass</span>(<span style="font-weight: bold;">type</span>):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__new__</span>(metaclass, name, bases, attrs):
        <span style="font-weight: bold; font-style: italic;">attrs</span>[<span style="font-style: italic;">'creator'</span>] = metaclass.<span style="font-weight: bold;">__name__</span>
        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">type</span>.__new__(metaclass, name, bases, attrs)

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(cls, name, bases, attrs):
        <span style="font-weight: bold; font-style: italic;">cls.name</span> = cls.creator + <span style="font-style: italic;">'.'</span> + name

    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__call__</span>(cls, *args, **kwargs):
        <span style="font-weight: bold;">print</span>(<span style="font-style: italic;">'Create an instance with type %s.'</span> % cls.name)
        <span style="font-weight: bold; font-style: italic;">obj</span> = cls.__new__(cls, *args, **kwargs)
        obj.__init__(*args, **kwargs)
        <span style="font-weight: bold;">return</span> obj


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestClass</span>(<span style="font-weight: bold;">object</span>, metaclass=MyMetaClass):
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">__init__</span>(<span style="font-weight: bold;">self</span>, name):
        <span style="font-weight: bold;">self</span>.name = name


<span style="font-weight: bold;">print</span>(TestClass(<span style="font-style: italic;">'job'</span>).name)


<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">output ##</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Create an instance with type MyMetaClass.TestClass.</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">job</span>
</pre>
</div>

<p>
对于 <code>__new__</code> 和 <code>__init__</code> 其实没有什么好说的， <code>__new__</code> 创建元类的实例 <b>类</b>,  <code>__init__</code> 中设置创建的 <b>类</b> 的属性。
</p>

<p>
比较有趣的方法是元类中的 <code>__call__</code> 方法。
</p>

<p>
当我们将一个实例当做函数使用时， 会调用方法 <code>__call__</code>. 而 <b>元类</b> 的实例是 <b>类</b>, 什么时候我们会把 <b>类</b> 当做函数使用 ？
</p>

<p>
<b>创建类的实例的时候</b>.
</p>

<p>
因此， <code>MyMetaClass.__call__</code> 会在创建 <code>TestClass</code> 的实例的时候调用， 因此我们会在上面那个例子中看到输出：
</p>
<pre class="example">
Create an instance with type MyMetaClass.TestClass.
</pre>

<p>
创建实例的过程可以参考 <a href="python-new-instance.html">Python 构造对象实例</a> 中的代码：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">create_instance</span>(obj_type, *args, **kwargs):
    <span style="font-weight: bold; font-style: italic;">obj</span> = obj_type.__new__(*args, **kwargs)
    <span style="font-weight: bold;">if</span> obj <span style="font-weight: bold;">is</span> <span style="font-weight: bold;">not</span> <span style="font-weight: bold; text-decoration: underline;">None</span> <span style="font-weight: bold;">and</span> <span style="font-weight: bold;">issubclass</span>(obj, obj_type):
        obj.__init__(*args, **kwargs)
    <span style="font-weight: bold;">return</span> obj
</pre>
</div>

<p>
这个时候， 我们就得到了这样一条关系链条：
</p>
<pre class="example">
    元类 --&gt; 类 --&gt; 类的实例
</pre>

<p>
到了这个地方， 我觉得需要讨论一下 <b>类属性</b> 和 <b>实例属性</b> 的关系。
</p>
</div>
</div>

<div id="outline-container-org8401c9b" class="outline-2">
<h2 id="org8401c9b"><span class="section-number-2">4</span> 类属性和实例属性</h2>
<div class="outline-text-2" id="text-4">
<p>
搞清楚 <b>类属性</b> 和 <b>实例属性</b> 的关系之前， 需要明确的两点是：
</p>
<ul class="org-ul">
<li><code>Python</code> 之中， 一切皆是对象</li>
<li><b>获取属性</b> 和 <b>设置属性</b> 的行为不同</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">OneClass</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold; font-style: italic;">num</span> = 10


<span style="font-weight: bold; font-style: italic;">A</span> = OneClass()
<span style="font-weight: bold; font-style: italic;">B</span> = OneClass()
<span style="font-weight: bold;">print</span>(A.num, B.num, OneClass.num)

<span style="font-weight: bold; font-style: italic;">A.num</span> += 2
<span style="font-weight: bold;">print</span>(A.num, B.num, OneClass.num)

<span style="font-weight: bold; font-style: italic;">OneClass.num</span> += 2
<span style="font-weight: bold;">print</span>(A.num, B.num, OneClass.num)
</pre>
</div>

<p>
以上代码的执行结果为：
</p>
<pre class="example">
10 10 10
12 10 10
12 12 12
</pre>

<p>
<b>对此的理解</b>:
</p>
<ol class="org-ol">
<li><b>类</b> 是一个对象， <b>实例</b> 也是一个对象</li>
<li>通过类似 <code>self.xxx = xxx</code> 的方式设置的属性直接 <b>绑定</b> 到 <b>实例对象</b></li>
<li>直接在 <b>类</b> 内部定义的属性 <b>没有绑定</b> 到 <b>实例</b>, 而是 <b>绑定</b> 到 <b>类</b> 对象</li>
<li>访问一个 <b>实例对象</b> 不存在的 <b>属性</b> 的时候会尝试从 <b>类对象</b> 获去那个属性</li>
<li>设置 一个 <b>实例对象</b> 不存在的 <b>属性</b> 的值的时候， 会尝试从 <b>类对象</b> 获取属性的值，
然后将运算后的结果 <b>绑定</b> 到 <b>实例</b> 上， 使之成为 <b>实例属性</b></li>
</ol>

<p>
这里需要明白的是： <b>元类和类</b>, <b>类和实例</b>, 都满足这一关系。
</p>

<p>
即： 获取 <b>类</b> 不存在的属性会尝试获取 <b>元类</b> 的属性。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MyMetaClass</span>(<span style="font-weight: bold;">type</span>):
    <span style="font-weight: bold; font-style: italic;">language</span> = <span style="font-style: italic;">'English'</span>


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestClass</span>(<span style="font-weight: bold;">object</span>, metaclass=MyMetaClass):
    <span style="font-weight: bold;">pass</span>


<span style="font-weight: bold;">print</span>(TestClass.language)
<span style="font-weight: bold;">print</span>(TestClass().language)


<span style="font-weight: bold; font-style: italic;">## </span><span style="font-weight: bold; font-style: italic;">output ##</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">English</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">AttributeError: 'TestClass' object has no attribute 'language'</span>
</pre>
</div>

<p>
这个例子中， 获取 <code>TestClass</code> 的实例的 <code>language</code> 属性出错， 但获取 <code>TestClass</code> 的 <code>language</code> 属性没有问题。
</p>

<p>
所以， 获取 <b>类的实例</b> 不存在的属性不会传递到 <b>元类</b>.
</p>
</div>
</div>

<div id="outline-container-org9ec5f66" class="outline-2">
<h2 id="org9ec5f66"><span class="section-number-2">5</span> 元类的使用</h2>
<div class="outline-text-2" id="text-5">
<p>
元类的使用我也没有多少经验， 只能简单的列出一些自己尝试的结果。
</p>

<ul class="org-ul">
<li><p>
<b>__new__</b> 方法的参数
</p>

<p>
一般情况下， 我们使用元类都是这样使用的：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestClass</span>(<span style="font-weight: bold;">object</span>, metaclass=MyMetaClass):
    <span style="font-weight: bold;">pass</span>
</pre>
</div>

<p>
这种情况下， 类的创建是隐式完成的， 参数应该和 <code>type</code> 相同， 否则会出错。
</p>

<p>
另一种情况， 显示创建类时， 我们可以定义自己的参数：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;">TestClass</span> = MyMetaClass(...)
</pre>
</div>

<p>
这种情况下， 我们需要保证的是在 <code>MyMetaClass</code> 的 <code>__new__</code> 方法中保证使用 <code>type.__new__</code> 创建
类的参数正确。
</p>

<p>
当然， 个人十分不推荐这种用法。
</p></li>

<li><p>
<b>__init__</b> 和 <b>__new__</b> 参数的一致性
</p>

<p>
创建类时， 得到元类的实例 <b>类</b> 后调用 <b>__init__</b> 方法的过程我们无法插手， 因此需要保证
<b>__init__</b> 的参数比 <b>__new__</b> 具有更高的 <b>包容性</b>.
</p>

<p>
最低限度是能够容纳所有的 <b>name</b>, <b>bases</b> 和 <b>attrs</b> 这三个参数。
</p>

<p>
这一点对于 <b>类</b> 和 <b>类的实例</b> 也是基本适用的， 特殊情况就是在 <b>元类</b> 的 <b>__call__</b> 方法中进行调整。
</p>

<p>
当然， 我同样十分不推荐这种做法。
</p></li>

<li><p>
<b>Python2</b> 和 <b>Python3</b> 的兼容
</p>

<p>
<code>Python2</code> 和 <code>Python3</code> 中定义元类的方式不同：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Python2</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestClass</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold; font-style: italic;">__metaclass__</span> = MyMetaClass


<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Python3</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">TestClass</span>(<span style="font-weight: bold;">object</span>, metaclass=MyMetaClass):
    <span style="font-weight: bold;">pass</span>
</pre>
</div>

<p>
如果需要兼容， 可以这样做：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> six <span style="font-weight: bold;">import</span> with_metaclass

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Meta</span>(<span style="font-weight: bold;">type</span>):
    <span style="font-weight: bold;">pass</span>

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Base</span>(<span style="font-weight: bold;">object</span>):
    <span style="font-weight: bold;">pass</span>

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">MyClass</span>(with_metaclass(Meta, Base)):
    <span style="font-weight: bold;">pass</span>
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-org7671369" class="outline-2">
<h2 id="org7671369"><span class="section-number-2">6</span> 结语</h2>
<div class="outline-text-2" id="text-6">
<p>
<code>Python</code> 给了我们很大程度上的自由， 我们可以运用各种奇淫技巧写出各种神奇的代码。
</p>

<p>
但是， 我感觉有一句话还是很有道理的： <b>如非必要, 勿增实体.</b>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
